{
	"projects": [
		{
			"name": "Psg eSports",
			"slug": "psg-esports",
			"year": 2016,
			"url": "http://psg-esports.com/",
			"description": "I had the chance to work on the brand new website for the newly created Paris Saint Germain (PSG for the soccer fans) eSport structure. The design was already defined and with my friend Benjamin, we had to develop a managable website so that the team responsible for the site could add news, update teams members or the latest results. I setted up the project and was in charge of the pages: team, single news and news archives. I had to code a custom slider with two active items and custom transitions. The main difficulty was on the archive page (like always in wordpress) that use ajax calls to switch between all the news montly and yearly.",
			"context": "Freelance",
			"role": "Front/Back-end developer",
			"techno": "Wordpress, Scss, Gulp, Ajax",
			"media_home": "psg-home.jpg",
			"color": "#FE0317",
			"first_media": [
				"psg/psg-01.png",
				"vertical"
			],
			"medias": [
				"/psg/psg-02.png",
				"/psg/psg-03.png"
			]
		},
		{
			"name": "Les enfants du web",
			"slug": "les-enfants-du-web",
			"year": 2016,
			"url": "http://enfantsduweb.wtf/",
			"description": "As a big 3d year project in Hetic, we had our first real client (excluding freelance of course). For my team it was Synerg'Hetic the school junior enterprise. Since they aready had a corporate website, we had to find another idea to highlight the greatest value of Synerg'hetic, its students and their creativity. They call themselves the 'web children' or 'Enfants du web' in french, we took it literally... We personified each student with a small baby, defined by its main skill (we ask student directly to get all our datas). It was the occasion for us to use React. The other developer handled the board movement and the form while I was in charge of the baby placement and all the interactions.",
			"context": "School project",
			"role": "Front-end developer",
			"techno": "React, TweenMax, Interact.js, Scss",
			"media_home": "edw-home.png",
			"color": "#E1BEE7",
			"first_media": [
				"edw/edw-01.png",
				"horizontal"
			],
			"medias": [
				"edw/edw-02.png",
				"edw/edw-03.png"
			]
		},
		{
			"name": "Soroptimist Europe",
			"slug": "soroptimist-europe",
			"year": 2016,
			"url": "http://soroptimisteurope.org/",
			"description": "[Out soon] Last summer I spent almost 4 month with the amazing FCINQ team. It was a great opportunity to improve my skills in PHP, Wordpress and responsive integration among the other developers. Soroptimist was not the only project I worked on (instantfrites.fr, suicidesquad.fr), but for this one I had an almost complete autonomy. This was the biggest and most complex project I've worked on, and a chance to learn all aspects of Wordpress.",
			"context": "/w Agency FCINQ",
			"role": "Front/Back-end developer",
			"techno": "Wordpress, TweenMax, Google Maps API",
			"media_home": "sorop-home.jpg",
			"color": "#3c70be",
			"first_media": [
				"sorop/sorop-01.png",
				"vertical"
			],
			"medias": [
				"sorop/sorop-02.png",
				"sorop/sorop-03.png"
			]
		},
		{
			"name": "Skyyart",
			"slug": "skyyart",
			"year": 2016,
			"url": "http://skyyart.fr/",
			"description": "The first time I experienced freelance and joining an existing project at the same time. The development had already begun when I joined the team but the first integration wasn't adapted for the project needs of modularity and future evolution. With two other developers (one as back-end and another as front-end and mainly on the home-made live chat), I integrated all the new sketches just before adding dynamic datas provided by the two other developers.",
			"context": "Freelance",
			"role": "Integrator / Front-end developer",
			"techno": "Meteor",
			"media_home": "skyyart-home.png",
			"color": "#FFC540",
			"first_media": [
				"skyyart/skyyart-01.png",
				"horizontal"
			],
			"medias": [
				"skyyart/skyyart-02.png",
				"skyyart/skyyart-03.png"
			]
		},
		{
			"name": "Geek art",
			"slug": "geek-art",
			"year": 2016,
			"url": "http://geek-art.borislaporte.com/",
			"description": "This website was developed for front-end project in the 3d year in Hetic. We had to realise a website that use object oriented javascript with gulp task manager and templating. We use that occasion to do a tribute to a book about Geek art that we loved. As 3 developers one was resonsible for the D3.js visualization, another one handleded the templating/navigation and I was in charge of all the integration and visual effects.",
			"context": "School project",
			"role": "Integrator / Front-end developer",
			"techno": "Gulp, Handlebars, Scss",
			"media_home": "geek-art-home.png",
			"color": "#84B9F7",
			"first_media": [
				"geek-art/geek-art-01.png",
				"horizontal"
			],
			"medias": [
				"geek-art/geek-art-02.png",
				"geek-art/geek-art-03.png"
			]
		},
		{
			"name": "Folio 2016",
			"slug": "folio-2016",
			"year": 2016,
			"url": "http://old.stephenrichard.fr/",
			"description": "The previous version of this Portfolio (it was already the V4) made last year. It was the first I was really proud of when I put it online and a great occasion to use and pratice gulp and fancy animation with TweenMax.",
			"context": "Personnal project",
			"role": "Designer / developer",
			"techno": "Gulp, TweenMax, Scss",
			"media_home": "2016-home.png",
			"color": "#38AF88",
			"first_media": [
				"folio-2016/folio-2016-01.png",
				"horizontal"
			],
			"medias": [
				"folio-2016/folio-2016-02.png",
				"folio-2016/folio-2016-03.png"
			]
		}
	]
}